# Part 15

In [1]:
import numpy as np
import pandas as pd

# Persiapan Data Frame

In [6]:
data = {
    "nama":["Ali Asghor","Gerry Germog","Pace Pacul"],
    "tempat_kelahiran":['Darmawangsa,Jaksel','Sudirman,Jakpus','Pantai Indah Kapul,Jakut']
}
df = pd.DataFrame(data)
df

           nama          tempat_kelahiran
0    Ali Asghor        Darmawangsa,Jaksel
1  Gerry Germog           Sudirman,Jakpus
2    Pace Pacul  Pantai Indah Kapul,Jakut

# Memecah Nama Depan Dan Nama Belakang

In [11]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ',expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,tempat_lahir,nama_kota
0,Ali Asghor,"Darmawangsa,Jaksel",Ali,Asghor,Darmawangsa,Jaksel
1,Gerry Germog,"Sudirman,Jakpus",Gerry,Germog,Sudirman,Jakpus
2,Pace Pacul,"Pantai Indah Kapul,Jakut",Pace,Pacul,Pantai Indah Kapul,Jakut

# Memecah tempat_kelahiran Menjadi Dua Column Berbeda

In [10]:
df[['tempat_lahir','nama_kota']] = df['tempat_kelahiran'].str.split(',',expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,tempat_lahir,nama_kota
0,Ali Asghor,"Darmawangsa,Jaksel",Ali,Asghor,Darmawangsa,Jaksel
1,Gerry Germog,"Sudirman,Jakpus",Gerry,Germog,Sudirman,Jakpus
2,Pace Pacul,"Pantai Indah Kapul,Jakut",Pace,Pacul,Pantai Indah Kapul,Jakut